In [34]:
import pandas as pd
import numpy as np

In [3]:
cols = "passenger_count trip_distance total_amount".split()
cols

['passenger_count', 'trip_distance', 'total_amount']

In [5]:
df = pd.read_csv('../data/nyc_taxi_2019-01.csv', usecols=cols)

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7667792 entries, 0 to 7667791
Data columns (total 3 columns):
 #   Column           Dtype
---  ------           -----
 0   passenger_count  int64
 1   trip_distance    float64
 2   total_amount     float64
dtypes: float64(2), int64(1)
memory usage: 175.5 MB

In [6]:
df.head(3)

   passenger_count  trip_distance  total_amount
0                1            1.5          9.95
1                1            2.6         16.30
2                3            0.0          5.80

In [20]:
df.sort_values('trip_distance', ascending=False).head(20)['total_amount'].mean()

290.00999999999993

In [31]:
df.sort_values('trip_distance', ascending=False)['total_amount'].iloc[:20].mean()

290.00999999999993

In [16]:
df.sort_values('trip_distance', ascending=True)

         passenger_count  trip_distance  total_amount
7667791                1           0.00          0.00
4863796                0           0.00          3.30
4863795                2           0.00          3.30
4863794                2           0.00          3.30
4863793                1           0.00          3.30
...                  ...            ...           ...
4881766                1         201.27        152.46
4707513                2         211.36         56.56
6770897                5         214.01        761.80
4286612                1         700.70          9.00
6074021                1         831.80         11.76

[7667792 rows x 3 columns]

In [22]:
df.sort_values('trip_distance', ascending=True)['total_amount'].tail(20).mean()

290.01000000000005

In [32]:
df.sort_values('trip_distance', ascending=True)['total_amount'].iloc[-20:].mean().round(2)

290.01

In [38]:
# np.float128 not implemented!
# df = pd.read_csv('../data/nyc_taxi_2019-01.csv', usecols=cols, 
#                dtype={'total_amount': np.float128})

Sort by ascending passenger count and descending trip distance. (So, start with
the longest trip with 0 passengers and end with the shortest trip with 9 passen-
gers.) What is the average price paid for the top 50 rides?

In [41]:
df.sort_values(['passenger_count', 'trip_distance'], ascending=[True, False]).iloc[:50].mean()

passenger_count      0.0000
trip_distance       35.0790
total_amount       135.4974
dtype: float64

### Beyond 1
 In which five rides did people pay the most per mile? How far did people go on
those trips?

In [46]:
# remove zero-length trips
df = df.loc[df['trip_distance'] != 0]
df

         passenger_count  trip_distance  total_amount  amt_per_mile
0                      1           1.50          9.95      6.633333
1                      1           2.60         16.30      6.269231
7                      1           1.30          9.05      6.961538
8                      1           3.70         18.50      5.000000
9                      2           2.10         13.00      6.190476
...                  ...            ...           ...           ...
7667783                2           4.15         15.80      3.807229
7667784                1           1.34          9.30      6.940299
7667785                1           1.45         14.16      9.765517
7667786                2           4.28         21.96      5.130841
7667787                1           4.79         23.16      4.835073

[7613022 rows x 4 columns]

In [47]:
df['amt_per_mile'] = df['total_amount'] / df['trip_distance']
df.sort_values('amt_per_mile', ascending=False).head()

         passenger_count  trip_distance  total_amount   amt_per_mile
2499600                1           2.40     623261.66  259692.358333
478791                 1           0.10       6667.45   66674.500000
7099014                4           0.01        415.30   41530.000000
6403254                1           0.01        322.30   32230.000000
4136499                1           0.01        273.96   27396.000000

### Beyond 2
Letâ€™s assume that multipassenger rides are split evenly among the passengers.
Given that assumption, in which 10 multipassenger rides did each individual
pay the greatest amount?

In [52]:
df = pd.read_csv('../data/nyc_taxi_2019-01.csv', usecols=cols)
df.head()

   passenger_count  trip_distance  total_amount
0                1            1.5          9.95
1                1            2.6         16.30
2                3            0.0          5.80
3                5            0.0          7.55
4                5            0.0         55.55

In [53]:
df.shape

(7667792, 3)

In [54]:
df = df.loc[df['passenger_count'] > 1]
df.shape

(2094290, 3)

In [55]:
df['amt_per_pass'] = df['total_amount'] / df['passenger_count']

In [58]:
df.sort_values('amt_per_pass', ascending=True).tail(10)

         passenger_count  trip_distance  total_amount  amt_per_pass
1154626                2           0.00        400.80       200.400
4751745                2         100.78        403.50       201.750
6496403                2           0.00        410.95       205.475
6857368                2           0.00        411.36       205.680
5726185                2          65.05        416.82       208.410
149362                 2          17.20        426.80       213.400
7593395                2          83.61        449.32       224.660
3842620                2         110.04        515.82       257.910
3014027                2          16.60        560.76       280.380
2972145                2          19.90        589.96       294.980

### Beyond 3
In the exercise solution, I showed that we needed to use iloc or head/tail to
retrieve the first/last 20 rows because the index was scrambled after our sort
operation. But you can pass ignore_index=True to sort_values: then the
resulting data frame has a numeric index starting at 0. Use this option and loc
to get the mean total_amount for the 20 longest trips.

Result differs from provided solution, which selects 21 trips.

In [59]:
df = pd.read_csv('../data/nyc_taxi_2019-01.csv', usecols=cols)
df.head()

   passenger_count  trip_distance  total_amount
0                1            1.5          9.95
1                1            2.6         16.30
2                3            0.0          5.80
3                5            0.0          7.55
4                5            0.0         55.55

In [65]:
len(df.sort_values('trip_distance', ascending=False, ignore_index=True).loc[:19])

20

In [67]:
df.sort_values('trip_distance', ascending=False, ignore_index=True).loc[:19, 'total_amount'].mean()

290.00999999999993

In [72]:
df.sort_values('trip_distance', ascending=False, ignore_index=True)['total_amount'].loc[:19,].mean()

290.00999999999993

In [71]:
# provided solution has 21 values!
df.sort_values('trip_distance',
                ascending=False,
              ignore_index=True)['total_amount'].loc[:20].count()

21